In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:

ser1 =Series(np.arange(3),index=['A','B','C'])

In [3]:
ser1

A    0
B    1
C    2
dtype: int32

In [4]:
ser2=ser1*2

In [5]:
ser2

A    0
B    2
C    4
dtype: int32

In [6]:
# Exmple 1 - How to pull entries by index

#sample 1
ser2['B'] # we can pull either by giving Index

2

In [9]:
ser2[2] # BY default series will be  indexed  with numerical number starting  from 0, we can use that to  pull the entries

4

In [ ]:
# sample 2 - Grabing entries with range

In [12]:
ser2[0:3] # this can be done  by giving range of  numerical index

A    0
B    2
C    4
dtype: int32

In [20]:
# Sample 3
# this can be done  by giving list of index value
ser1[['A','B']]

A    0
B    1
dtype: int32

In [21]:
# Example 2 - Pulling entries  by logic

In [29]:
ser2[ser2 !=2]

A    0
C    4
dtype: int32

In [39]:
ser2[ser2 !=2]

A    PASS
C    PASS
dtype: object

In [40]:
ser2

A    PASS
B       2
C    PASS
dtype: object

In [42]:
ser2[ser2==2] = 'Just Pass'

In [43]:
ser2

A         PASS
B    Just Pass
C         PASS
dtype: object

In [44]:
# Example 3  - Selecting  entries in data frame

In [45]:
dframe= DataFrame(np.arange(25).reshape(5,5),index=['NYC','LA','SF','DC','CHE'],
                  columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHE  20  21  22  23  24

In [47]:
#sample - pulling entries columns wise


dframe['B']

NYC     1
LA      6
SF     11
DC     16
CHE    21
Name: B, dtype: int32

In [49]:
# sample -  pulling entries list of columns

dframe[['B','D']]

      B   D
NYC   1   3
LA    6   8
SF   11  13
DC   16  18
CHE  21  23

In [52]:
# sample - pulling entries with  logic
dframe[dframe["C"]>10]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHE  20  21  22  23  24

In [58]:
# sample -  pulling entries with boolean 

dframe >10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHE   True   True   True   True   True

In [74]:
# sample -  pulling  enties of data  frame with index lable 
dframe[1:3]

     A   B   C   D   E
LA   5   6   7   8   9
SF  10  11  12  13  14